tap "elastic/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
brew "docker"
brew "git"
brew "go"
brew "golangci-lint"
brew "iproute2mac"
brew "krb5"
brew "node"
brew "mongodb-atlas-cli"
brew "openssl@1.1"
brew "postgresql@14", restart_service: true
brew "rabbitmq"
brew "redis", restart_service: true
brew "tree"
brew "typescript"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
cask "alfred"
cask "appcleaner"
cask "firefox"
cask "fork"
cask "gitkraken"
cask "knockknock"
cask "mongodb-compass"
cask "netiquette"
cask "postman"
cask "valentina-studio"
cask "visual-studio-code"
vscode "alefragnani.Bookmarks"
vscode "alexkrechik.cucumberautocomplete"
vscode "amandeepmittal.pug"
vscode "andys8.jest-snippets"
vscode "bbenoist.shell"
vscode "dbaeumer.vscode-eslint"
vscode "ditto.convert-html-to-pug"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "henriiik.docker-linter"
vscode "humao.rest-client"
vscode "jinliming2.vscode-go-template"
vscode "maxnatchanon.go-struct-tag-autogen"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-pugbeautify"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "RalfZhang.filetemplate"
vscode "rldnrl.typescript-snippet"
vscode "rvest.vs-code-prettier-eslint"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-vietnamese"
vscode "swyphcosmo.spellchecker"
vscode "TabNine.tabnine-vscode"
vscode "tgreen7.vs-code-node-require"
vscode "vinliao.fast-arrow"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "xabikos.JavaScriptSnippets"
vscode "zxh404.vscode-proto3"
